{
  "proposal": {
    "content": {
      "title": "PGF - Namada Builder Allocations",
      "authors": "Gavin Birch (Luminara 🔅)",
      "discussions-to": "https://forum.namada.net/t/namada-builder-allocations-round-1-2-05m-nam/1623",
      "created": "2025-04-01",
      "abstract": "PGF proposal to distribute total of 2,050,000 NAM",
      "motivation": "(see abstract)",
      "details": "**This is a PGF (public goods funding) proposal asking voters to distribute a total of 2.05m NAM to the five (5) Namada addresses listed below,** in recognition of the Namada community builders.\n\nThis proposal was tested and reviewed after being executed on the Housefire testnet: https://explorer75.org/namada-housefire/proposals/19\n\n## Specifics\n\n✅ [Free and open-source](https://forum.namada.net/t/discussion-pgf-priorities-for-software-in-namada/1501) Namada software:\n\n* **Daniel / Mandragora - 750,000 NAM** - `tnam1qzcgkzmddnru8w07zntd6wpywd8vptdgpu8mz44a`\n\n- Namada indexing software, [Undexer](https://github.com/hackbg/undexer) -> [OSS licence](https://github.com/hackbg/undexer/blob/v4/LICENSE)\n\n- Namada IBC decoding library, [Fadroma](https://forum.namada.net/t/decoding-of-ibc-transaction-types-is-now-supported/1244) -> [OSS licence](https://github.com/hackbg/fadroma/blob/v2/LICENSE)\n\n✅ Dedicated Namada explorer services:\n\n* **ProNodes - [Explorer75](https://explorer75.org/) - 300,000 NAM** - `tnam1qqd2ys42y2t5vgdtdx6epstnkykvjedxxsuc6lry`\n\n* **Bitszn - [Valopers](https://namada.valopers.com/) - 300,000 NAM** - `tnam1qzt4klml5za7zn05rx569s5hfcr4nfl8zc3d4fwu`\n\n* **Daniel / Mandragora - [Shielded Live](https://shielded.live/) - 250,000 NAM** - `tnam1qzcgkzmddnru8w07zntd6wpywd8vptdgpu8mz44a`\n\n* **[Coverlet Namada Explorer Beta](https://namada.coverlet.io/) - 250,000 NAM** - `tnam1qqsrhr894nnupdyu2fqrg290pyxd50pq5vrj8xtf`\n\n* **[Sproutstake Namada Explorer](https://namada-explorer.sproutstake.space/) - 200,000 NAM** - `tnam1qrfyg27adsuege6ef94rek5d6cvjcs2afyw9nrhq`\n\nThese tnam addresses have been lifted from user profiles, Discord and/or the forum. If you use their services / software, you can tip them anytime! @shurinov @alx @Daniel @Leon @Oneplus\n\n## Criteria\n\nIf software is useful and being used by our community, **open sourcing it under an unrestrictive licence is kind of a big deal.** It's essentially giving the Namada community your work. I posted a bit about that here in https://forum.namada.net/t/discussion-pgf-priorities-for-software-in-namada/1501.\n\n### Table stakes\n\nNamada's explorer services are not (yet) open source, so accuracy and reliability should be table stakes for consideration. The Namada community is totally dependent upon service providers to run the service and and to fix the issues, especially accuracy issues that may misinform Namada users and other stakeholders.\n\nThere should also be a standard for what the service provides. It can be tempting to re-use a project across many Cosmos projects, for example, which can be fine if it's adding new value. Since Namada has a unique code-base, it can be hard to re-use code for querying and transacting, but we anticipate that a service worth recognizing will offer more advanced functionality than the very basics of network exploring, or the very basics of Namada transactions, especially if it's a service offering beyond Namada. As our ecosystem matures, this standard should also mature.\n\nFor example, a niche service that provides shielded pool metrics and statistics is noteworthy if launched and running now, because this information is otherwise not easily accessible in a palatable way. Now imagine if these metrics were already fully integrated into the explorer services three months ago--launching such an app in this more mature ecosystem would not be adding new value.\n\n### Differentiators\n\nOther key considerations we made for this proposal involved\n\n**impact**\n\n- how useful has this service / software been to those who use and/or contribute to Namada? how useful is it likely to be going forward?\n\n**advanced features**\n\n- is there something niche that's particularly useful? ie. solves a specific problem\n\n- is the entire set of features particularly useful? ie. a \"one-stop shop\" for a particular kind of activity\n\n**timing & activity**\n\n- how early and long-running is this service / software?\n\n- is functionality improving? do improvements reflect the needs of users and/or contributors or other stakeholders?\n\n## Context\n\nThree weeks ago we called for what are essentially the first set of Namada Builder nominations:\n\nhttps://forum.namada.net/t/nominations-call-for-namada-apps-tools-and-services/1583\n\nAt this early stage of Namada, builders have primarily advanced Namada explorer code and services, critical to the Namada experience and ever-more important as we advance through Phases 4 and 5.\n\nThese builders have dedicated their valuable attention and efforts to Namada, most of which did so before Namada was widely known, and are the earliest builders in our ecosystem.\n\n## A bet on Namada's future\n\nEarly stage builders in Namada have made risky bets, especially given the uncertainties around when Namada would launch. I remember saying I couldn't be part of our family vacation a few months before June 2023 because \"Namada mainnet may be launching\" 😅\n\nRetroactive public goods funding is not just recognition--it's also a signal:\n\n1) we're betting on a shared future with these builders\n\n2) there's an opportunity for newcomers to attain a meaningful Namada position\n\nIt could be that some of Namada's most important contributors haven't even joined yet.\n\nNamada PGF is a unique opportunity to drive Namada ownership toward **active** contributors, which benefits everyone invested in Namada's success. Let’s get these folks some more Namada ownership 🎊 and keep the PGF culture rolling.\n\nWe're keeping an eye out for up-and-coming builders!",
      "requires": "0"
    },
    "author": "tnam1qztdx4y7a3wn0qmgcgtrty237vcnp9f9hs3rt3k7",
    "voting_start_epoch": 476,
    "voting_end_epoch": 496,
    "activation_epoch": 736
  },
  "data": {
    "continuous": [],
    "retro": [
      {
        "Internal": {
          "amount": "750000000000",
          "target": "tnam1qzcgkzmddnru8w07zntd6wpywd8vptdgpu8mz44a"
        }
      },
      {
        "Internal": {
          "amount": "300000000000",
          "target": "tnam1qqd2ys42y2t5vgdtdx6epstnkykvjedxxsuc6lry"
        }
      },
      {
        "Internal": {
          "amount": "300000000000",
          "target": "tnam1qzt4klml5za7zn05rx569s5hfcr4nfl8zc3d4fwu"
        }
      },
      {
        "Internal": {
          "amount": "250000000000",
          "target": "tnam1qzcgkzmddnru8w07zntd6wpywd8vptdgpu8mz44a"
        }
      },
      {
        "Internal": {
          "amount": "250000000000",
          "target": "tnam1qqsrhr894nnupdyu2fqrg290pyxd50pq5vrj8xtf"
        }
      },
      {
        "Internal": {
          "amount": "200000000000",
          "target": "tnam1qrfyg27adsuege6ef94rek5d6cvjcs2afyw9nrhq"
        }
      }
    ]
  }
}